Revit 2025 API
Document.OwnerFamily Property
Get the Family of this Family Document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public Family OwnerFamily { get; }
Public ReadOnly Property OwnerFamily As Family
	Get
public:
property Family^ OwnerFamily {
	Family^ get ();
}
member OwnerFamily : Family with get
Property Value
Family
Remarks
 Only available if the current document is family document.
Example
string categoryName = familyDoc.OwnerFamily.FamilyCategory.Name;
Dim categoryName As String = familyDoc.OwnerFamily.FamilyCategory.Name
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace